{
    "editor": [
        "编辑：林坤",
        "审核：林坤",
        "发布者：林坤"
    ],
    "date": "2016-10-09",
    "sub_title": null,
    "title": "名师讲堂：Lightweight Cryptography for Internet-of-Things",
    "content": "<div class=\"Degas_news_content\">\n                \n<p>　　人力资源部教师发展中心开展“名师讲堂”系列活动，以定期邀请国内外知名专家学者、国家级教学名师等作专题报告，旨在加强广大师生的学术思想交流和碰撞，促进青年教师成长，开拓学生视野。</p>\n<p>　　“名师讲堂”第39期活动特别邀请IEEE FELLOW、加拿大滑铁卢大学龚光教授主讲，欢迎广大师生参与。具体安排如下：</p>\n<p>　　<strong>一、主　题：</strong>Lightweight Cryptography for Internet-of-Things（面向物联网等低功耗节点网络的轻量级密码）</p>\n<p><strong>　　二、主讲人：</strong>IEEE FELLOW 龚光教授</p>\n<p>　　三<strong>、时　间：</strong>10月12日（周三）15:00</p>\n<p>　　四<strong>、地　点：</strong>清水河校区研究院大楼一楼中庭报告厅　</p>\n<p>　　<strong>五、主持人：</strong>通信抗干扰技术国家级重点实验室 李胜强副教授</p>\n<p>　　<strong>六、主办单位：</strong>人力资源部教师发展中心</p>\n<p>　　<strong>七、承办单位：</strong>通信抗干扰技术国家级重点实验室 网络空间中心</p>\n<p>　　<strong>八、内容简介</strong></p>\n<p>　　Ensuring the security and privacy of embedded systems, Internet-of-Things at large, has become one of the most important challenges in computing today. Low-end embedded wireless devices are deployed in an increasing number and variety of applications.  This multitude of devices and information systems are becoming integrated into the daily life of consumers, businesses, governments, and the military.  This integration of web-based and mobile applications, and multi-mode communication between people and automated devices has the potential to bring tremendous benefits in efficiency and functionality, but also carries with it tremendous risks in security and privacy. In this talk, I will start by introducing the current status on the design of lightweight cryptography for IoT and follow by introducing two lightweight cryptographic primitives, Simeck and Warbler. </p>\n<p>　　<strong>九、主讲人简介</strong></p>\n<p>　　Guang Gong, Ph.D. (1990), has been a full Professor at Department of Electrical and Computer Engineering，University of Waterloo，since 2004. Dr. Gong’s research interests are in the areas of signal design, cryptography, and communication security. She has authored or co-authored more than 320 technical papers and two books, Signal Design for Good Correlation for Wireless Communication, Cryptography and Radar (2005), co-authored with Dr. Golomb, Communication System Security (2012), coauthored with Dr. Lidong Chen. Dr. Gong serves/served as Associate Editors for several journals including Associate Editor of the journal of Cryptography and Communications - Discrete Structures, Boolean Functions and Sequences (2007 -), and Associate Editor for Sequences for IEEE Transactions on Information Theory (2005-2008), and served on numerous technical program committees and conferences as co-chairs/organizers or committee members. Dr. Gong has received several awards including the Best Paper Award from the Chinese Institute of Electronics in 1984, Outstanding Doctorate Faculty Award of Sichuan Province, China, in 1991,  the Premier’s Research Excellence Award, Ontario, Canada, in 2001, NSERC　Discovery Accelerator Supplement Award, 2009, Canada, and  Ontario Research Fund -Research Excellence Award, 2010, Canada, Best Paper Award of IEEE ICC 2012, and IEEE Fellow 2014 for her contributions to sequences and cryptography applied to communications and security.</p>\n<p><br></p>\n<p>　　　　　　　　　　　　　　　　　　人力资源部教师发展中心</p>\n<p>　　　　　　　　　　　　　　　　　　　　2016年10月9日</p>\n<p><br></p>\n            </div>",
    "img": [],
    "authors": [
        "文：教师发展中心",
        "来源：人力资源部",
        "点击量：189"
    ],
    "author": "文：教师发展中心"
}